Repository: CrsVirlan/ipsx-ios
Catalog: IPSX/Common/Strings/*.lproj/Localizable.strings
Languages: ro_ro

# Generic Error Message
source: Something went wrong. Please try again!
ro_ro: Ceva nu a mers bine, încercați înca odată!

# Login Failed Error Message
source: Login failed. Please try again!
ro_ro: Login eșuat. Incercați incă odată!

# Invalid Login Error Message
source: User account invalid
ro_ro: Contul este invalid

# Test Proxy Message
source: Try it now for free!
ro_ro: încercați-l acum gratis!

# Test Proxy Name
source: Free Test Proxy
ro_ro: Proxy de test gratis

source: active
ro_ro: activ

source: expired
ro_ro: expirat

# ETH Address Already Used Error Message
source: The eth address has already been taken.
ro_ro: Adresa este deja folosită.

# User Info Error Message
source: Error retrieving user info.
ro_ro: Nu am reușit să obțin datele utilizatorului.

# Refresh Data Error Message
source: Couldn't refresh data
ro_ro: Actualizarea datelor a eșuat

# Insufficient Balance Error Message
source: Insufficient balance
ro_ro: Fonduri insuficiente

# Balance Empty Info Message
source: Your current balance is empty! Please request tokens.
ro_ro: Nu aveți nicio moneda IPSX! Apăsați 'Cerere tokeni de test'

source: My Address
ro_ro: Adresa mea

# Amount Limits Error Message Min %@ Max %@
source: The amount should be between %@ and %@
ro_ro: Suma trebuie să fie cuprinsă între %@ și %@ IPSX

# Select Valid ETH Wallet Message
source: Select a valid ETH wallet
ro_ro: Selectați o adresă validă de Ethereum

# Redirect to Settings Error Message
source: Can't redirect, please open the Settings manually.
ro_ro: Redirectarea a eșuat, deschideți setările aplicației manual.

source: Saved
ro_ro: Salvat

source: Select a country
ro_ro: Selectați o țară

source: Package
ro_ro: Pachete

source: Other Details
ro_ro: Alte detalii

source: New proxy created! Copy pac link to continue
ro_ro: Proxy nou creat! Apasă copiază pentru a continua

source: Start Date
ro_ro: Data începerii

source: End Date
ro_ro: Data expirării

source: Country
ro_ro: Țara

source: User IP
ro_ro: IP utilizator

# Max %@ ETH addresses Error Message
source: You are allowed to have max %@ ETH addresses
ro_ro: Aveți voie sa adaugați maxim %@ adrese

# Max %@ Token Requests Error Message
source: You are allowed to make max %@ requests per day
ro_ro: Aveți voie sa efectuați maxim %@ cereri pe zi

# Delete Address Confirmation Alert Title
source: Are you sure you want to delete this address?
ro_ro: Sigur doriți să ștergeți această adresă?

source: Cancel
ro_ro: Anulează

source: Delete
ro_ro: Șterge

source: No internet connection
ro_ro: Făra conexiune la internet

# Wrong Old Password Error Message
source: Wrong old password
ro_ro: Parola veche greșită

# Change Password Success Message
source: Password changed
ro_ro: Parola schimbată

# Login After Change Password Alert Message
source: Password changed. Tap OK to Login
ro_ro: Parola schimbată. Apasă OK pentru Login

# Connect to the internet message
source: Please connect to the internet to continue!
ro_ro: Conectați-vă la internet pentru a continua!

# Loading message
source: Loading, please wait...
ro_ro: Îcarcă, așteptați...

# Facebook Login Error Message
source: Facebook Login Error. Please try again!
ro_ro: Eroare conectare cu Facebook. Mai incercați odată!

# User already registered Error Message
source: This user is already registered. Please go to Login
ro_ro: Utilizatorul este deja înregistrat. Mergeți la Login

# User Not Registered Error Message
source: This user has not registered with Facebook
ro_ro: Utilizatorul nu este inregistrat cu Facebook

# Enroll for Testing Title
source: Enroll for Testing
ro_ro: înrolare Testing

# Enroll for Staking Title
source: Enroll for Staking
ro_ro: Înrolare Staking

# Enrolled for Testing Title
source: Enrolled for Testing
ro_ro: Înrolat pentru Testing

# Enrolled for Staking Title
source: Enrolled for Staking
ro_ro: Înrolat pentru Staking

# Add ETH Address text
source: Add ETH Address
ro_ro: Adaugă adresa ETH

# Add your ETH address text
source: Add your ETH address
ro_ro: Adaugă adresa ETH

# Edit ETH Address text
source: Edit ETH Address
ro_ro: Editează adresa ETH

# Edit your ETH address text
source: Edit your ETH address
ro_ro: Editează adresa ETH

# Connect to WiFi network message
source: Please connect to a WiFi network
ro_ro: Conectați-vă la o rețea WiFi

source: Getting IP info...
ro_ro: Obținere IP info...

# Proxy locked on IP %@ message
source: The proxy will be locked on your current IP address: %@
ro_ro: Proxiul va fi blocat pe această adresa de IP: %@

# Proxy Expired Alert Message
source: You can no longer use this proxy.
ro_ro: Proxiul a expirat, nu mai poate fi folosit!

# Device IP %@ Mismatch Alert Message
source: Your device's IP %@ doesn't match the IP used to activate the proxy!
ro_ro: IP-ul %@ actual nu se portivește cu cel folosit la activarea proxiului!

# Need one validated ETH address message.
source: You need to have at least one validated ETH address.
ro_ro: Este nevoie de cel puțin o adresă validă de ETH.

# Address Locked Toast Message
source: You can't delete this ETH address because it's locked
ro_ro: Adresa ETH nu poate fi ștearsă pentru ca e blocată

# User Deleted Error Message
source: Your account has been deleted. Please contact support for details.
ro_ro: Contul a fost șters. Contactați suportul pentru detalii.

# Token Deposit Created %@ IPSX expiration date %@ Message
source: Deposit created successfully! Please make a %@ IPSX payment until deposit expiration date: %@
ro_ro: Depozitul a fost creat cu succes! Depozitați %@ IPSX înainte de expirarea termenului: %@

source: Time Remaining: %@
ro_ro: Timp rămas: %@

# Create Deposit Not Possible Message
source: You have a pending deposit. Please cancel it before creating a new one.
ro_ro: Există un depozit în așteptare. Așteptatți sau anulați-l înainte de a crea altul nou.

# Deposit Wrong Amount Error Message
source: The amount should be greater than zero!
ro_ro: Suma trebuie să fie mai mare decât zero!

# Reset Password Not Possible Message
source: Reset password of this account is not possible from IPSX app.
ro_ro: Resetarea parolei nu este posibila prin intermediula plicației IPSX.

source: Requested
ro_ro: Ceruți

source: Received
ro_ro: Primiți

# Reflink Copied Message
source: The referral link has been copied. Send it to your friends.
ro_ro: Linkul a fost copiat. Trimiteți-l prietenilor.

# Staking Program end alert message %@
source: The Staking Program for this session has been closed on %@
ro_ro: Programul de Staking s-a incheiat in data de %@

# Enrolled Address Delete Message
source: The ETH address will be removed from staking and testing program
ro_ro: Adresa va fi scoasă din programele de Tesing și Staking

# Wrong Password Error Message
source: Wrong password. Please try again!
ro_ro: Parolă greșită. Încercați din nou!

# Settings Camera Redirect Message
source: Please go to Settings and allow the app to use the camera.
ro_ro: Mergeți în setări pentru a activa accesul la camera foto.

source: Go to Settings
ro_ro: Setări

# ETH Address Copied Message
source: The ETH address has been copied to clipboard
ro_ro: Adresa ETH a fost copiata in clipboard

# Unknown Status Text
source: Unknown
ro_ro: Necunoscut

# Registered Status Text
source: Registered
ro_ro: Înregistrat

# Approved Status Text
source: Approved
ro_ro: Aprobat

# Pending Status Text
source: Pending
ro_ro: În așteptare

# Incomplete Status Text
source: Incomplete
ro_ro: Incomplet

# Waiting Status Text
source: Waiting
ro_ro: În coadă

# Rejected Status Text
source: Rejected
ro_ro: Respins

# Accepted Status Text
source: Accepted
ro_ro: Acceptat
